app/controllers/api/v1/quotes_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."person_id" = $1 ORDER BY RANDOM() LIMIT $2  [["person_id", 1], ["LIMIT", 1]]
---
  def show
    @quote = @person.quotes.order("RANDOM()").first

INSERT INTO "quotes" ("content", "person_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test"], ["person_id", 6], ["created_at", "2020-05-29 15:37:41.470638"], ["updated_at", "2020-05-29 15:37:41.470638"]]
---
  def create
    @quote = Quote.new(content: params[:content])
    @quote.person = Person.find_by(name: params[:person].downcase)
    if @quote.save